/* Copyright(C)URARA-works 2007 */
/* ========================================================================= */
/* ファイル名	:ParamUtil.h												 */
/* 内容			:区切り文字付きのパラメータ分解クラス 定義ファイル			 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2007/05/02													 */
/* ========================================================================= */

#pragma once

/* ========================================================================= */
/* クラス宣言																 */
/* ========================================================================= */
class CParamUtil
{
public:
			CParamUtil();								/* コンストラクタ */
	virtual ~CParamUtil();								/* デストラクタ */

	void	Set			(LPCSTR pszText, char cSeparator=' ');	/* パラメータ設定 */
	int		GetCount	(void);									/* パラメータ数取得 */
	LPCSTR	GetParam	(int nNo);								/* パラメータ取得 */


protected:
	CmyStringArray		m_astrParam;					/* 分解されたパラメータ */
};

/* Copyright(C)URARA-works 2007 */
