/* Copyright(C)URARA-works 2005 */
/* ========================================================================= */
/* ファイル名	:SaveLoadInfoMap.cpp										 */
/* 内容			:データ保存・読み込みクラス(マップ情報) 実装ファイル		 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2005/11/08													 */
/* ========================================================================= */

#include "stdafx.h"
#include "SaveLoadInfoMap.h"


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoMap::CSaveLoadInfoMap								 */
/* 内容		:コンストラクタ													 */
/* 日付		:2005/11/08														 */
/* ========================================================================= */

CSaveLoadInfoMap::CSaveLoadInfoMap()
{
	/* ファイル名の設定 */
	SetFileName ("SBODATA\\SboDataMap.dat");
}


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoMap::~CSaveLoadInfoMap							 */
/* 内容		:デストラクタ													 */
/* 日付		:2005/11/08														 */
/* ========================================================================= */

CSaveLoadInfoMap::~CSaveLoadInfoMap()
{
}

/* Copyright(C)URARA-works 2005 */
