/* Copyright(C)URARA-works 2007 */
/* ========================================================================= */
/* ファイル名	:SaveLoadInfoMotion.cpp										 */
/* 内容			:データ保存・読み込みクラス(モーション情報) 実装ファイル	 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2007/11/23													 */
/* ========================================================================= */

#include "stdafx.h"
#include "SaveLoadInfoMotion.h"


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoMotion::CSaveLoadInfoMotion						 */
/* 内容		:コンストラクタ													 */
/* 日付		:2007/07/26														 */
/* ========================================================================= */

CSaveLoadInfoMotion::CSaveLoadInfoMotion()
{
	/* ファイル名の設定 */
	SetFileName ("SBODATA\\SboDataMotion.dat");
}


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoMotion::~CSaveLoadInfoMotion						 */
/* 内容		:デストラクタ													 */
/* 日付		:2007/07/26														 */
/* ========================================================================= */

CSaveLoadInfoMotion::~CSaveLoadInfoMotion()
{
}

/* Copyright(C)URARA-works 2007 */
