/* Copyright(C)URARA-works 2007 */
/* ========================================================================= */
/* ファイル名	:SaveLoadInfoItem.cpp										 */
/* 内容			:データ保存・読み込みクラス(アイテム情報) 実装ファイル		 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2007/08/19													 */
/* ========================================================================= */

#include "stdafx.h"
#include "SaveLoadInfoItem.h"


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoItem::CSaveLoadInfoItem							 */
/* 内容		:コンストラクタ													 */
/* 日付		:2007/08/19														 */
/* ========================================================================= */

CSaveLoadInfoItem::CSaveLoadInfoItem()
{
	/* ファイル名の設定 */
	SetFileName ("SBODATA\\SboDataItem.dat");
}


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoItem::~CSaveLoadInfoItem							 */
/* 内容		:デストラクタ													 */
/* 日付		:2007/08/19														 */
/* ========================================================================= */

CSaveLoadInfoItem::~CSaveLoadInfoItem()
{
}

/* Copyright(C)URARA-works 2007 */
