/* Copyright(C)URARA-works 2008 */
/* ========================================================================= */
/* ファイル名	:SaveLoadInfoSkill.cpp										 */
/* 内容			:データ保存・読み込みクラス(スキル情報) 実装ファイル		 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2008/12/04													 */
/* ========================================================================= */

#include "stdafx.h"
#include "SaveLoadInfoSkill.h"


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoSkill::CSaveLoadInfoSkill							 */
/* 内容		:コンストラクタ													 */
/* 日付		:2008/12/04														 */
/* ========================================================================= */

CSaveLoadInfoSkill::CSaveLoadInfoSkill()
{
	/* ファイル名の設定 */
	SetFileName ("SBODATA\\SboDataSkill.dat");
}


/* ========================================================================= */
/* 関数名	:CSaveLoadInfoSkill::~CSaveLoadInfoSkill						 */
/* 内容		:デストラクタ													 */
/* 日付		:2008/12/04														 */
/* ========================================================================= */

CSaveLoadInfoSkill::~CSaveLoadInfoSkill()
{
}

/* Copyright(C)URARA-works 2008 */
