/* Copyright(C)URARA-works 2005 */
/* ========================================================================= */
/* ファイル名	:InfoBase.cpp												 */
/* 内容			:情報基底クラス 実装ファイル								 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2005/06/06													 */
/* ========================================================================= */

#include "stdafx.h"
#include "InfoBase.h"

/* ========================================================================= */
/* 関数名	:CInfoBase::CInfoBase											 */
/* 内容		:コンストラクタ													 */
/* 日付		:2005/05/03														 */
/* ========================================================================= */

CInfoBase::CInfoBase()
{
	m_nElementCount = 0;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::~CInfoBase											 */
/* 内容		:デストラクタ													 */
/* 日付		:2005/05/03														 */
/* ========================================================================= */

CInfoBase::~CInfoBase()
{
}


/* ========================================================================= */
/* 関数名	:CInfoMapParts::GetElementCount									 */
/* 内容		:要素数を取得													 */
/* 日付		:2005/05/03														 */
/* ========================================================================= */

int CInfoBase::GetElementCount(void)
{
	return m_nElementCount;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::GetElementNo										 */
/* 内容		:要素番号を取得													 */
/* 日付		:2005/05/03														 */
/* ========================================================================= */

int CInfoBase::GetElementNo(LPCSTR pszName)
{
	return 0;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::GetDataSize											 */
/* 内容		:データサイズを取得												 */
/* 日付		:2005/05/03														 */
/* ========================================================================= */

DWORD CInfoBase::GetDataSize(void)
{
	return 0;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::GetDataSizeNo										 */
/* 内容		:指定要素のデータサイズを取得									 */
/* 日付		:2005/06/06														 */
/* ========================================================================= */

DWORD CInfoBase::GetDataSizeNo(int nNo)
{
	return 0;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::GetName												 */
/* 内容		:要素名を取得													 */
/* 日付		:2005/06/06														 */
/* ========================================================================= */

LPCSTR CInfoBase::GetName(int nNo)
{
	return NULL;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::GetWriteData										 */
/* 内容		:指定要素の保存用データを取得									 */
/* 日付		:2005/06/06														 */
/* ========================================================================= */

PBYTE CInfoBase::GetWriteData(int nNo, PDWORD pdwSize)
{
	return NULL;
}


/* ========================================================================= */
/* 関数名	:CInfoBase::ReadElementData										 */
/* 内容		:指定要素データを読み込み										 */
/* 日付		:2005/06/06														 */
/* ========================================================================= */

DWORD CInfoBase::ReadElementData(
	PBYTE pSrc,		/* [in] データの読み込み元 */
	int nNo)		/* [in] 要素番号 */
{
	return 0;
}

/* Copyright(C)URARA-works 2005 */
