/* Copyright(C)URARA-works 2005 */
/* ========================================================================= */
/* ファイル名：	crc.cpp														 */
/* 内容：		CRC計算クラス 実装ファイル									 */
/* 作成：		年がら年中春うらら(URARA-works)								 */
/* 作成開始日：	2005/03/29													 */
/* 参考：		http://www.rfc-editor.org/rfc/rfc1952.txt					 */
/* ========================================================================= */

#include "stdafx.h"
#include "crc.h"


/* ========================================================================= */
/* 関数名：	CCRC::CCRC														 */
/* 内容：	コンストラクタ													 */
/* 日付：	2005/03/29														 */
/* ========================================================================= */
CCRC::CCRC()
{
	m_padwCRC = new DWORD[256];
	MakeTbl ();
}


/* ========================================================================= */
/* 関数名：	CCRC::~CCRC														 */
/* 内容：	デストラクタ													 */
/* 日付：	2005/03/29														 */
/* ========================================================================= */
CCRC::~CCRC()
{
	if (m_padwCRC) {
		delete [] m_padwCRC;
		m_padwCRC = NULL;
	}
}


/* ========================================================================= */
/* 関数名：	CCRC::Update													 */
/* 内容：	CRCを更新														 */
/* 日付：	2005/03/29														 */
/* ========================================================================= */
DWORD CCRC::Update(
	DWORD dwSrc,		/* [in] 計算元のCRC値 */
	PBYTE pBuf,			/* [in] 計算したいバッファ */
	DWORD dwSize)		/* [in] バッファサイズ */
{
	DWORD i, dwTmp = dwSrc ^ 0xFFFFFFFF;

	for (i = 0; i < dwSize; i ++) {
		dwTmp = m_padwCRC[(dwTmp ^ pBuf[i]) & 0xFF] ^ (dwTmp >> 8);
	}

	return (dwTmp ^ 0xFFFFFFFF);
}


/* ========================================================================= */
/* 関数名：	CCRC::GetCRC													 */
/* 内容：	CRCを取得														 */
/* 日付：	2005/03/29														 */
/* ========================================================================= */
DWORD CCRC::GetCRC(
	PBYTE pBuf,			/* [in] 計算したいバッファ */
	DWORD dwSize)		/* [in] バッファサイズ */
{
	return Update (0, pBuf, dwSize);
}


/* ========================================================================= */
/* 関数名：	CCRC::MakeTbl													 */
/* 内容：	計算用テーブルを作成											 */
/* 日付：	2005/03/29														 */
/* ========================================================================= */
void CCRC::MakeTbl(void)
{
	DWORD i, j, dwTmp;

	for (i = 0; i < 256; i++) {
		dwTmp = i;
		for (j = 0; j < 8; j++) {
			if (dwTmp & 1) {
				dwTmp = 0xEDB88320 ^ (dwTmp >> 1);

			} else {
				dwTmp = dwTmp >> 1;
			}
		}
		m_padwCRC[i] = dwTmp;
	}
}

/* Copyright(C)URARA-works 2005 */
