/* Copyright(C)URARA-works 2008 */
/* ========================================================================= */
/* ファイル名	:SBOVersion.h												 */
/* 内容			:バージョン定義ファイル										 */
/* 作成			:年がら年中春うらら(URARA-works)							 */
/* 作成開始日	:2008/06/07													 */
/* ========================================================================= */

#pragma once

/* ========================================================================= */
/* 定数定義																	 */
/* ========================================================================= */

#define VERTEXT					"Ver0.027.2"						/* バージョン */
#define VERSIONVAL				(0x00002702)						/* バージョン番号 */
#define DLLVER					"1"									/* DLLバージョン */
#define GRPDATADLLVER			"4"									/* グラフィックデータDLLバージョン */

/* Copyright(C)URARA-works 2008 */
